In [1]:
import numpy as np
import pandas as pd

### What if we have duplicate indices

In [3]:
# Create a Dataframe
df4 = pd.DataFrame(np.arange(9, 18).reshape(3, 3),
                   index=[1, 2, 3], 
                   columns=['a', 'b', 'c']
)

print(df4)

    a   b   c
1   9  10  11
2  12  13  14
3  15  16  17

In [5]:
df1 = pd.DataFrame(np.arange(0, 9).reshape(3, 3), index=[1, 2, 3], columns=['a', 'b', 'c'])

print(df1)

   a  b  c
1  0  1  2
2  3  4  5
3  6  7  8

In [6]:
pd.concat([df1, df4])

    a   b   c
1   0   1   2
2   3   4   5
3   6   7   8
1   9  10  11
2  12  13  14
3  15  16  17

In [7]:
pd.concat([df1, df4], ignore_index=True)

    a   b   c
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14
5  15  16  17

In [8]:
# Column-wise
pd.concat([df1, df4], axis=1)

   a  b  c   a   b   c
1  0  1  2   9  10  11
2  3  4  5  12  13  14
3  6  7  8  15  16  17

In [9]:
pd.concat([df1, df4], axis=1, ignore_index=True)

   0  1  2   3   4   5
1  0  1  2   9  10  11
2  3  4  5  12  13  14
3  6  7  8  15  16  17

In [11]:
# We want to specify the labels for the data sources

pd.concat([df1, df4], keys=['df1', 'df4'])

        a   b   c
df1 1   0   1   2
    2   3   4   5
    3   6   7   8
df4 1   9  10  11
    2  12  13  14
    3  15  16  17

In [12]:
# Combine data where some of the columns are common

df5 = pd.DataFrame(np.arange(27, 36).reshape(3, 3), 
                  index=[4, 5, 6], 
                  columns=['b', 'c', 'd'])

print(df5)

    b   c   d
4  27  28  29
5  30  31  32
6  33  34  35

In [13]:
pd.concat([df1, df5])

     a   b   c     d
1  0.0   1   2   NaN
2  3.0   4   5   NaN
3  6.0   7   8   NaN
4  NaN  27  28  29.0
5  NaN  30  31  32.0
6  NaN  33  34  35.0

In [14]:
# Performing intersection or getting the output where columns are same

pd.concat([df1, df5], join='inner')

    b   c
1   1   2
2   4   5
3   7   8
4  27  28
5  30  31
6  33  34

In [15]:
# Specify the results output as the same of particular columns

pd.concat([df1, df5.reindex(columns=df1.columns)])

     a   b   c
1  0.0   1   2
2  3.0   4   5
3  6.0   7   8
4  NaN  27  28
5  NaN  30  31
6  NaN  33  34

### Combin datasets: Merge and Join

- Using 'pd.merge()' function to implements a number of types to joins

- one-to-one (When the values are unique in keys of both the datasets)

- many-to-one (When the values of one of key is duplicate)

- many-to-many (When the values of both the dataset key's are duplicate)

In [17]:
df1 = pd.DataFrame({
    'employee': ['Bob', 'Jake', 'Lisa', 'Sue'], 
    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']
})

df2 = pd.DataFrame({
    'employee': ['Lisa', 'Jake', 'Bob', 'Sue'], 
    'hire_year': [2004, 2008, 2012, 2014]
})

In [18]:
display(df1, df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_year
0     Lisa       2004
1     Jake       2008
2      Bob       2012
3      Sue       2014

### One-to-one

In [20]:
pd.merge(df1, df2)

  employee        group  hire_year
0      Bob   Accounting       2012
1     Jake  Engineering       2008
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [22]:
df3 = pd.merge(df1, df2)
print(df3)

  employee        group  hire_year
0      Bob   Accounting       2012
1     Jake  Engineering       2008
2     Lisa  Engineering       2004
3      Sue           HR       2014

### Many-to-one joins

In [23]:
df4 = pd.DataFrame({
    'group': ['Accounting', 'Engineering', 'HR'], 
    'supervisor': ['Charly', 'Guido', 'Steve']
})

print(df4)

         group supervisor
0   Accounting     Charly
1  Engineering      Guido
2           HR      Steve

In [24]:
pd.merge(df3, df4)

  employee        group  hire_year supervisor
0      Bob   Accounting       2012     Charly
1     Jake  Engineering       2008      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

###  Many-to-many

In [26]:
df5 = pd.DataFrame({
    'group': ['Accounting', 'Accounting', 'Engineering','Engineering', 'HR', 'HR'], 
    'skills': ['math', 'spreadsheets', 'coding', 'linux', 'spreadsheets', 'organization']
})

print(df5)

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [27]:
pd.merge(df1, df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

### We want combine two datasets with different column name but same values

- Using 'left_on' and 'right_on' keywords to specify the two columns names

In [29]:
df6 = pd.DataFrame({
    'name': ['Bob', 'Jake', 'Lisa', 'Sue'], 
    'salary': [70000, 80000, 120000, 9000]
})

print(df6)

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue    9000

In [31]:
pd.merge(df1, df6, left_on='employee', right_on='name')

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue    9000

In [32]:
# Drop duplicate column

pd.merge(df1, df6, left_on='employee', right_on='name').drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR    9000

In [34]:
display(df1, df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_year
0     Lisa       2004
1     Jake       2008
2      Bob       2012
3      Sue       2014

In [35]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')

In [36]:
display(df1a, df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

          hire_year
employee
Lisa           2004
Jake           2008
Bob            2012
Sue            2014

- To merge the datasets base on index we use 'left_index' and 'right_index'

In [39]:
pd.merge(df1a, df2a, left_index=True, right_index=True)

                group  hire_year
employee
Bob        Accounting       2012
Jake      Engineering       2008
Lisa      Engineering       2004
Sue                HR       2014

- We want to combine the data using index and column

In [44]:
display(df1a, df6)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue    9000

In [45]:
pd.merge(df1a, df6, left_index=True, right_on='name')

         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue    9000

### What if the values appear in one column key but not the other

In [46]:
df7 = pd.DataFrame({
    'name': ['Peter', 'Paul', 'Mary'], 
    'food': ['fish', 'beans', 'bread']
})

df8 = pd.DataFrame({
    'name': ['Mary', 'John'],
    'drink': ['wine', 'beer']
})

In [47]:
display(df7, df8)

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

   name drink
0  Mary  wine
1  John  beer

In [49]:
# By default it is giving the output base on inner join

pd.merge(df7, df8)

   name   food drink
0  Mary  bread  wine

In [50]:
# Intersection join using 'how='inner''

pd.merge(df7, df8, how='inner')

   name   food drink
0  Mary  bread  wine

In [51]:
# Union join using 'how='outer''

pd.merge(df7, df8, how='outer')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine
3   John    NaN  beer

### Overlapping column names

### What if we have conflicting columns names

In [52]:
df9 = pd.DataFrame({
    'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
    'rank': [1, 2, 3, 4]
})

df10 = pd.DataFrame({
    'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
    'rank': [3, 1, 4, 2]
})

display(df9, df10)

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

In [54]:
pd.merge(df9, df10, on='name')

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [57]:
pd.merge(df9, df10, on='name', suffixes=['_L', '_R'])

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2